README.org
*** Highlighting

#+begin_src emacs-lisp :tangle init.el
;; Highlight line containing point
(global-hl-line-mode)

;; Highlight matching parentheses
(use-package paren
  :custom
  (show-paren-style 'parenthesis "Only highlight ()")
  (show-paren-when-point-inside-paren t)
  (show-paren-when-point-in-periphery t)
  ;; If cursor on ), show overlay for (
  (show-paren-context-when-offscreen 'overlay)
  :config (electric-pair-mode 1))

;; Highlight killed region
;; https://www.youtube.com/watch?v=oQ9JE9kRwG8
(defun gopar/pulse-current-region (&rest _)
  "pulse the current implicit or active region"
  (if mark-active
      (pulse-momentary-highlight-region (region-beginning) (region-end))
    (pulse-momentary-highlight-region (mark) (point))))

(advice-add #'kill-ring-save :before #'gopar/pulse-current-region)
#+end_src

*** Bookmarks

The built-in =bookmark.el= package allows us to quickly store and access
specific locations in frequently visited files. I mostly use the
following functions:

+ bookmark-set :: ~C-x r m~; Set bookmark at current location
  - Prompt user for desired name of bookmark
  - Bookmarked locations indicated by flag in fringe of buffer
  - Bookmark details stored in =bookmark-alist=
+ bookmark-jump :: ~C-x r b~; Select bookmark and jump to location
+ bookmark-save :: Export =bookmark-alist= to specified file
+ bookmark-delete :: Delete bookmark in =bookmark-alist=
+ bookmark-bmenu-list :: Open buffer containing all bookmarks

*N.B.* The built-in =register.el= package is a more temporary alternative
to =bookmark=, and are assigned to a single character instead of a
name. For more information, checkout this [[https://www.youtube.com/watch?time_continue=3&v=RLPU65RLiC4&embeds_referring_euri=https%3A%2F%2Fwww.reddit.com%2F][youtube video]]. I have not
explored registers much.

#+begin_src emacs-lisp :tangle init.el
(use-package bookmark
  :custom
  ;; By default 'no-littering' package stores bookmark file to 'var/',
  ;; which is lost if performing a "fresh" Emacs install. To persist,
  ;; set 'bookmark-default-file' to store in personal 'scratch/'
  ;; directory.  (bookmark-default-file "~/scratch/jon/.bookmarks.el")
  (bookmark-save-flag t "Save bookmarks when Emacs killed")
  (bookmark-fringe-mark t "Non-nil to show icon in fringe"))
#+end_src

*** File Encoding

[[https://blog.hubspot.com/website/what-is-utf-8][UTF-8]] is central to the storage and encoding of text and
files. Although other encoding systems exist, =utf-8= is practically a
standard, at least in the West, and so it is important that we
instruct Emacs to treat files as UTF-8 by default (credit:
[[https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs][MasteringEmacs]]).

#+begin_src emacs-lisp :tangle init.el
(set-default-coding-systems 'utf-8)

;; Accept 'UTF-8' (uppercase) as a valid encoding in the coding header
;; https://github.com/Thaodan/emacs.d
(define-coding-system-alias 'UTF-8 'utf-8)
#+end_src

*** Line Numbers

#+begin_src emacs-lisp :tangle init.el
;; Show column number in the modeline
(column-number-mode t)

;; Display line numbers in prog-mode
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
#+end_src

*** Images

See also [[*Org Images][Org Images]].

#+begin_src emacs-lisp :tangle init.el
;; Open image files + automatically update buffer if image changes
(auto-image-file-mode 1)
(add-hook 'image-mode-hook 'auto-revert-mode)
#+end_src

*** Ediff

#+begin_src emacs-lisp :tangle init.el
;; Show ediffs in single window between left/right buffers
(setopt ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src

* my-visuals.el
** Visual Advice

#+begin_src emacs-lisp :tangle modules/my-visuals.el
;;; -*- lexical-binding: t -*-

;; Discard all themes before loading next
(define-advice load-theme (:before (&rest _args) theme-dont-propagate)
  (mapc #'disable-theme custom-enabled-themes))
#+end_src

** Theme

#+begin_src emacs-lisp :tangle modules/my-visuals.el
(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setopt doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

** Toggle Light & Dark Themes

#+begin_src emacs-lisp :tangle modules/my-visuals.el
(defun light ()
  (interactive)
  (load-theme 'doom-tomorrow-day t))

(defun dark ()
  (interactive)
  (load-theme 'doom-one t))

(dark)
#+end_src

** Icons

#+begin_src emacs-lisp :tangle modules/my-visuals.el
(use-package nerd-icons
  :config
  ;; Download nerd-icons if directory not found
  (unless (car (file-expand-wildcards
                (concat user-emacs-directory "elpa/nerd-icons-*")))
    (nerd-icons-install-fonts t)))
#+end_src

** Font

Example of emphasis markers in org-mode include *bold*, ~code~, =verbatim=,
/italics/, _underline_.

The following fonts were downloaded and added to the configuration by
doing the following:

+ Jetbrains Mono :: Manually downloaded from [[https://www.jetbrains.com/lp/mono/][jetbrains.com]]. The font
  was installed by following the [[https://www.jetbrains.com/lp/mono/#how-to-install][how-to]] instructions verbatim.

*N.B.* This section pulls heavily from [[https://github.com/daviwil/dotfiles/blob/emacs-home-service/.emacs.d/modules/dw-core.el][github/daviwil/.emacs.d]].

#+begin_src emacs-lisp :tangle modules/my-visuals.el
;; Set fonts
(set-face-attribute 'default nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)

(set-face-attribute 'variable-pitch nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)

;; Modified from https://stackoverflow.com/a/50052751
(defun set-font-size ()
  "Set the font-pt size."
  (interactive)
  (let* ((pt-size (string-to-number (read-string "Font size: ")))
         (font-height (* 10 pt-size)))
    (set-face-attribute 'default nil :height font-height)))
#+end_src

** Modeline

#+begin_src emacs-lisp :tangle modules/my-visuals.el
(use-package doom-modeline
  :config (doom-modeline-mode 1)
  :custom
  ;; Display project_name/../file_name
  (doom-modeline-buffer-file-name-style 'truncate-with-project)
  (doom-modeline-buffer-encoding nil "Dont care about UTF-8 badge")
  (doom-modeline-vcs-max-length 30   "Limit branch name length")
  (doom-modeline-enable-word-count t "Turn on wordcount"))
#+end_src

** Additional Highlighting

*N.B.* Built-in Emacs settings set in [[*Highlighting][Highlighting]]

#+begin_src emacs-lisp :tangle modules/my-visuals.el
;; Highlight occurrences of the same text in buffer
(use-package highlight-thing
  :demand t
  :hook ((prog-mode . highlight-thing-mode)
         (org-mode . highlight-thing-mode))
  :custom
  (highlight-thing-exclude-thing-under-point t)
  (highlight-thing-case-sensitive-p t)
  (highlight-thing-ignore-list
   '("False" "True", "return", "None", "if", "else", "self",
     "import", "from", "in", "def", "class")))
#+end_src

** Provide Visuals

#+begin_src emacs-lisp :tangle modules/my-visuals.el
(provide 'my-visuals)
#+end_src

* my-org.el
** Org Basics

#+begin_src emacs-lisp :tangle modules/my-org.el
;;; -*- lexical-binding: t -*-

;; The essentials
(use-package org
  :demand t
  :bind (("C-c l" . org-store-link)
         ("C-c a" . org-agenda)
         ("C-c c" . org-capture))
  :hook ((org-src-mode . whitespace-cleanup)
         ;; Automatic break line at 'current-fill-column' (line wrapping)
         (org-mode . turn-on-auto-fill))
  :custom
  (org-ellipsis " ")
  (org-startup-folded t    "Always fold headers")
  (org-startup-indented t  "Visually indent at startup")
  (org-adapt-indentation t "Align contents with heading")
  (org-element-use-cache nil "Avoid 'org-element--cache' error")
  ;; Link to ID not heading text; avoids broken links should heading change
  (org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id))
#+end_src

** Org Appearance
*** Modernize Org UI

#+begin_src emacs-lisp :tangle modules/my-org.el
;; "Modernizes" UI experience of 'org-mode'
(use-package org-modern
  :after org
  :init (global-org-modern-mode)
  :hook ((org-mode                 . org-modern-mode)
         (org-agenda-finalize-hook . org-modern-agenda))
  :commands (org-modern-mode org-modern-agenda))
#+end_src

*** Emphasis Markers

#+begin_src emacs-lisp :tangle modules/my-org.el
(setopt org-hide-emphasis-markers t)

;; Interactively toggle visability if cursor between markers
(use-package org-appear
  :after org
  :hook (org-mode . org-appear-mode)
  :custom (org-appear-inside-latex t))
#+end_src

** Org Key Behavior

#+begin_src emacs-lisp :tangle modules/my-org.el
;; 'C-a/e' jump to start-end of headline text
(setopt org-special-ctrl-a/e t)

;; 'C-k' behave different on headline text
(setopt org-special-ctrl-k t)

;; Do not delete hidden subtree with 'C-k'
(setopt org-ctrl-k-protect-subtree t)

;; ? speed-key opens Speed Keys help.
(setopt org-use-speed-commands
      ;; If non-nil, 'org-use-speed-commands' allows efficient
      ;; navigation of headline text when cursor is on leading
      ;; star. Custom function allows use of Speed keys if on ANY
      ;; stars.
      (lambda ()
        (and (looking-at org-outline-regexp)
             (looking-back "^\**"))))
#+end_src

** Org Images

#+begin_src emacs-lisp :tangle modules/my-org.el
(setopt org-startup-with-inline-images t
        ;; Allow for inline display of remote images
        org-display-remote-inline-images 'cache)

;; Refresh inline images after executing an 'src-block'
(add-hook 'org-babel-after-execute-hook
          (lambda () (org-display-inline-images nil t)))
#+end_src

** Org-Babel
*** General Org-Babel Settings

#+begin_src emacs-lisp :tangle modules/my-org.el
(setopt org-confirm-babel-evaluate nil
      org-src-window-setup 'current-window
      org-src-ask-before-returning-to-edit-buffer t)

;; Remove code indentation in org-src blocks
(setopt org-src-preserve-indentation t)
#+end_src

*** FIX: Display ANSI Error Colors

#+begin_src emacs-lisp :tangle modules/my-org.el
;; https://github.com/emacs-jupyter/jupyter/issues/366
(defun display-ansi-colors ()
  (ansi-color-apply-on-region (point-min) (point-max)))
#+end_src

** Org Templates
*** Org-Block Templates

#+begin_src emacs-lisp :tangle modules/my-org.el
(setopt org-structure-template-alist
      '(("x" . "example")
        ("q" . "quote")
        ("e" . "src emacs-lisp")
        ("m" . "src emacs-lisp :tangle modules/my-")
        ("s" . "src sh")
        ("p" . "src python")))
#+end_src

** Provide my-org

#+begin_src emacs-lisp :tangle modules/my-org.el
(provide 'my-org)
#+end_src

