README.org
* my-dired.el
:PROPERTIES:
:ID:       20596bd1-da74-408e-a84e-0b5b9f240398
:END:

The built-in =dired= package provides core functionality for navigating
directories and performing file operations within a =dired=-buffer.

#+begin_src emacs-lisp :tangle modules/my-dired.el
;;; -*- lexical-binding: t -*-

(use-package dired
  :ensure nil
  :commands dired
  :after my-functions
  :custom
  ;; -A :: Show hidden files but omit implied '.' and '..' targets
  ;; -h :: Make file sizes human-readable
  ;; -l :: Produce long=g, detailed listing (required by 'dired')
  ;; -v :: Sort file by version number
  ;; --group-directories-first :: List directories at top of buffer
  ;; --time-style=long-iso     :: List %Y-%m-%d %H:%M
  (dired-listing-switches (concat "-Ahlv"
                                  " --group-directories-first"
                                  " --time-style=long-iso"))

  ;; Refresh 'dired' buffer if directory changes
  (dired-auto-revert-buffer #'dired-buffer-changed-p)

  ;; If two 'dired' buffers open side-by-side, Emacs will suggest the
  ;; other buffer directory when moving files
  (dired-dwim-target t)

  :config

  ;; The variable 'dired-kill-when-opening-new-dired-buffer'
  ;; exists. However, there are use-cases for having multiple 'dired'
  ;; buffers open at the same time (see 'dired-dwim-target').
  (defun jh/dired-kill-all-buffers ()
    "Delete all open 'dired'-mode buffers."
    (interactive)
    (jh/kill-buffers-by-mode 'dired-mode)))
#+end_src

** Dired-X

The built-in =dired-x= package builds on =dired.el= by providing extended
and optional features including, but not limited to:

+ Omitted files :: =dired-omit-mode= tidies the =dired= buffer by hiding
  files based on regex patterns

+ Jumping to files :: Adds commands to quickly jump to files or
  directories in a project

#+begin_src emacs-lisp :tangle modules/my-dired.el
(use-package dired-x
  :ensure nil
  :after dired
  :command dired
  :custom
  ;; Files to ignore in 'dired' buffer.
  (dired-omit-files (concat dired-omit-files
                            "\|"
                            (rx (or (: bos (or "\.DS_Store"
                                               "__MACOSX"
                                               "\.git")
                                       eos)
                                    (: bos "__pycache__")
                                    ".ipynb_checkpoints"
                                    "\.~.*#"))))
  :config
  ;; Must activate 'dired-omit-mode' to omit 'dired-omit-files'.
  (add-hook 'dired-after-readin-hook 'dired-omit-mode))
#+end_src

** Dired-Aux

Finally, the =dired-aux= package includes auxiliary functions to support
additional functionality in =dired=, including (but not limited to):

+ Bulk operations :: Handle operations on multiple files more
  robustly, such as renaming and copying

+ File compression and decompression :: Adds commands for compressing
  and decompressing files directly from a =dired= buffer

+ Backup and auto-save file cleanup :: Includes features to clean up
  backup files and other temporary files more effectively

#+begin_src emacs-lisp :tangle modules/my-dired.el
(use-package dired-aux
  :ensure nil
  :after dired
  :command dired
  :bind (:map dired-mode-map
              ;; C-+ calls 'er/expand-region'
              ("M-+" . dired-create-empty-file))
  :custom
  ;; Revert dired-buffer after 'dired-do' operations
  (dired-do-revert-buffer t))
#+end_src

** wDired

The built-in ~wDired~ package is used to make =dired=-buffers
writable. This is useful for quickly renaming multiple files.

#+begin_src emacs-lisp :tangle modules/my-dired.el
(use-package wdired
  :ensure nil
  :after dired
  :command dired
  :commands (wdired-change-to-wdired-mode)
  :custom
  ;; Change permission using 'SPC'
  (wdired-allow-to-change-permissions t))
#+end_src

** Dired Icons

#+begin_src emacs-lisp :tangle modules/my-dired.el
(use-package nerd-icons-dired
  :ensure nil
  :after (dired nerd-icons)
  :hook (dired-mode))
#+end_src

** Provide my-dired.el

#+begin_src emacs-lisp :tangle modules/my-dired.el
(provide 'my-dired)

;;; my-dired.el ends here
#+end_src

* my-completion.el

#+begin_src emacs-lisp :tangle modules/my-completion.el
;;; -*- lexical-binding: t -*-
#+end_src

** Vertico
*** Vertico + Save-hist

The =vertico= package provides mini-buffer completion. Without it, for
instance, I am required to blindly type the name of the desired buffer
or file-path when calling ~switch-to-buffer~ or ~find-file~. Previous
completions are more quickly available

The =savehist= package saves the mini-buffer history so previous
completions are more quickly available.

*N.B.* The author recommends activating the packages in the ~:init~
section of =use-package= such that the mode gets enabled right
away. Note that this forces loading the package.

#+begin_src emacs-lisp :tangle modules/my-completion.el
;; Copied from https://github.com/minad/vertico
(use-package vertico
  :custom
  (vertico-cycle t "Return to top of list")
  (vertico-count 10 "N candidate suggestions")
  :hook (minibuffer-setup . vertico-repeat-save)
  :init (vertico-mode))

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init (savehist-mode 1))
#+end_src

*** Vertico-Directory

#+begin_src emacs-lisp :tangle modules/my-completion.el
;; Configure directory extension.
(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

** Marginalia

*N.B.* =nerd-icons= package added in [[*Icons][Icons]].

#+begin_src emacs-lisp :tangle modules/my-completion.el
;; Provides additional data to mini-buffer completion
(use-package marginalia
  :init (marginalia-mode 1))

;; Add nerd-icons to mini-buffer marginalia
(use-package nerd-icons-completion
  :after (marginalia nerd-icons)
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))
#+end_src

** Orderless

#+begin_src emacs-lisp :tangle modules/my-completion.el
;; Copied from https://github.com/oantolin/orderless/tree/master
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

** Consult

#+begin_src emacs-lisp :tangle modules/my-completion.el
;; For adding extra functionality to the completion interfaces
(use-package consult
  :bind (;; C-c bindings in `mode-specific-map'
         ("C-c M-x" . consult-mode-command)
         ("C-c h" . consult-history)
         ("C-c k" . consult-kmacro)
         ("C-c m" . consult-man)
         ("C-c i" . consult-info)
         ([remap Info-search] . consult-info)
         ;; C-x bindings in `ctl-x-map'
         ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
         ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
         ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
         ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
         ("C-x t b" . consult-buffer-other-tab)    ;; orig. switch-to-buffer-other-tab
         ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
         ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
         ;; Custom M-# bindings for fast register access
         ("M-#" . consult-register-load)
         ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
         ("C-M-#" . consult-register)
         ;; Other custom bindings
         ("M-y" . consult-yank-pop)                ;; orig. yank-pop
         ;; M-g bindings in `goto-map'
         ("M-g e" . consult-compile-error)
         ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
         ("M-g g" . consult-goto-line)             ;; orig. goto-line
         ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
         ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
         ("M-g m" . consult-mark)
         ("M-g k" . consult-global-mark)
         ("M-g i" . consult-imenu)
         ("M-g I" . consult-imenu-multi)
         ;; M-s bindings in `search-map'
         ("M-s d" . consult-find)                  ;; Alternative: consult-fd
         ("M-s c" . consult-locate)
         ("M-s g" . consult-grep)
         ("M-s G" . consult-git-grep)
         ("M-s r" . consult-ripgrep)
         ("M-s l" . consult-line)
         ("M-s L" . consult-line-multi)
         ("M-s k" . consult-keep-lines)
         ("M-s u" . consult-focus-lines)
         ;; Isearch integration
         ("M-s e" . consult-isearch-history)
         :map isearch-mode-map
         ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
         ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
         ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
         ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
         ;; Minibuffer history
         :map minibuffer-local-map
         ("M-s" . consult-history)                 ;; orig. next-matching-history-element
         ("M-r" . consult-history))                ;; orig. previous-matching-history-element

  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setopt register-preview-delay 0.5
          register-preview-function #'consult-register-format)
  ;; Optionally tweak the register preview window. This adds thin lines,
  ;; sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setopt xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

  :config
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis udsing the `consult-customize' macro.
  (consult-customize
   consult-theme
   :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-recent-file
   consult--source-project-recent-file
   :preview-key '("M-."))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setopt consult-narrow-key "<")

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
  ;;;; 1. project.el (the default)
  ;; (setopt consult-project-function #'consult--default-project--function)
  ;;;; 2. vc.el (vc-root-dir)
  ;; (setopt consult-project-function (lambda (_) (vc-root-dir)))
  ;;;; 3. locate-dominating-file
  ;; (setopt consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
  ;;;; 4. projectile.el (projectile-project-root)
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setopt consult-project-function (lambda (_) (projectile-project-root))))
  )
#+end_src

** Provide my-completion.el

#+begin_src emacs-lisp :tangle modules/my-completion.el
(provide 'my-completion)

;;; my-completion.el ends here
#+end_src

* my-dev.el

#+begin_src emacs-lisp :tangle modules/my-dev.el
;;; -*- lexical-binding: t -*-
#+end_src

** Terminal

#+begin_src emacs-lisp :tangle modules/my-dev.el
;; Terminal emulator inside Emacs
(use-package vterm
  ;; Requires compilation, which may not work without installing dependencies
  :init (setopt vterm-always-compile-module t)
  :config
  (defun jh/vterm-new ()
  "Prompt the user for a new vterm buffer name and open it."
  (interactive)
  (let ((vterm-buffer-name (read-string "Enter new vterm buffer name: ")))
    (vterm (generate-new-buffer-name (concat "*" vterm-buffer-name "*"))))))
#+end_src

