README.org
** Projectile-Mode

#+begin_src emacs-lisp :tangle modules/my-dev.el
;; To provide project management + navigation features
(use-package projectile
  :init (projectile-mode 1)
  :custom
  ;; Cache to prevent slow 'projectile-find-file' on larger projects
  (projectile-enable-caching t)
  :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map)))
#+end_src

** Lisp
*** Aggressive-Indent-Mode

No longer have to worry about indents getting messed up in emacs-lisp.

#+begin_src emacs-lisp :tangle modules/my-dev.el
;; Update indentation in response to changes to code
(use-package aggressive-indent
  :hook (emacs-lisp-mode))
#+end_src

** Yaml

#+begin_src emacs-lisp :tangle modules/my-dev.el
(use-package yaml-mode
  :mode ("\\.yml\\'" "\\.yaml\\'"))
#+end_src

** Provide my-dev.el

#+begin_src emacs-lisp :tangle modules/my-dev.el
(provide 'my-dev)

;;; my-dev.el ends here
#+end_src

* my-vc.el

#+begin_src emacs-lisp :tangle modules/my-vc.el
;;; -*- lexical-binding: t -*-
#+end_src

** Magit

The =magit= package is a texted-based user interface to Git (Git
Porcelain) inside Emacs [https://magit.vc/].

#+begin_src emacs-lisp :tangle modules/my-vc.el
(use-package magit
  :bind ("C-x g" . magit-status)
  :diminish magit-minor-mode
  :hook (git-commit-mode . (lambda () (setopt fill-column 72)))
  :mode ("/\\.gitmodules\\'" . conf-mode)
  :custom
  ;; hide ^M chars at the end of the line when viewing diffs
  (magit-diff-hide-trailing-cr-characters t)

  ;; Limit legth of commit message summary
  (git-commit-summary-max-length 50)

  ;; Open status buffer in same buffer
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)
  :config
  (defun jh/magit-kill-all-buffers ()
    "Kill all buffers derived from 'magit-mode'."
    (interactive)
    (jh/kill-buffers-by-mode 'magit-mode)))
#+end_src

** Auto-Revert

#+begin_src emacs-lisp :tangle modules/my-vc.el
;; Switching branchs may change file on disk; if so, refresh buffers
(global-auto-revert-mode)
#+end_src

** Git-Gutter

#+begin_src emacs-lisp :tangle modules/my-vc.el
(use-package git-gutter
  :hook (prog-mode org-mode)
  :bind (("C-x P" . git-gutter:previous-hunk)
         ("C-x N" . git-gutter:next-hunk)
         ("C-x G" . git-gutter:popup-hunk))
  :config
  ;; Must include if 'linum-mode' activated (common in 'prog-mode')
  ;; because 'git-gutter' does not work with 'linum-mode'.
  (use-package git-gutter-fringe
    :commands git-gutter-mode
    :config (global-git-gutter-mode)))
#+end_src

** Provide my-vc.el

#+begin_src emacs-lisp :tangle modules/my-vc.el
(provide 'my-vc)

;;; my-vc.el ends here
#+end_src

* my-productivity.el

#+begin_src emacs-lisp :tangle modules/my-productivity.el
;;; -*- lexical-binding: t -*-
#+end_src

** Anzu-mode

The =anzu= package provides a minor mode which displays the "current
match" and "total matches" information in the mode-line.

#+begin_src emacs-lisp :tangle modules/my-productivity.el
(use-package anzu
  :hook (emacs-startup . global-anzu-mode)
  :custom
  (anzu-search-threshold 1000 "Limit n words searched to reduce lag")
  (anzu-replace-threshold 50 "Limit n replacement overlay to reduce lag")
  (anzu-minimum-input-length 2 "Increase activation threshold to reduce lag")

  ;; Cleanup mode-line information
  (anzu-mode-lighter "" "Remove mode-name from results")
  (anzu-replace-to-string-separator "")

  :bind (;; Keybindings M-% and C-M-% do not change
         ([remap query-replace] . anzu-query-replace)
         ([remap query-replace-regexp] . anzu-query-replace-regexp)

         :map isearch-mode-map
         ;; Use Anzu-mode for replacing from isearch results (C-s or C-f)
         ([remap isearch-query-replace] . anzu-isearch-query-replace)
         ([remap isearch-query-replace-regexp] . anzu-isearch-query-replace-regexp)))
#+end_src

** Avy

The =avy= package is useful for jumping to visible text using a
char-based decision tree.

#+begin_src emacs-lisp :tangle modules/my-productivity.el
(use-package avy
  :bind (("M-j" . avy-goto-char-timer)  ;; orig. 'default-indent-new-line'
         :map isearch-mode-map
         ("M-j" . avy-isearch))
  :custom
  (avy-timeout-seconds 0.3 "Seconds before overlay appears")
  (avy-style 'pre "Overyly single char at beginning of word")
  :custom-face
  ;; Change colors to improve readability
  (avy-lead-face ((t (:background "#000000" :foreground "#33A4FF" :weight bold)))))
#+end_src

** Type-break Mode

It is not healthy to sit all day; even worse to not take breaks to
eat/drink/stretch/walk. The built-in =type-break-mode= enforces a
pomodoro-style break routine.

#+begin_src emacs-lisp :tangle modules/my-productivity.el
(use-package type-break
  :hook (after-init)
  :custom
  (type-break-interval (* 50 60) "Work session duration")
  (type-break-good-break-interval (* 5 60) "Break duration")
  (type-break-good-rest-interval nil "Start break immediately")
  (type-break-keystroke-threshold '(nil . nil) "Break due to time, not keystroke")
  (type-break-file-name nil "Donot save break info")
  (type-break-query-mode t "Remind later, if break declined")
  (type-break-query-function 'y-or-n-p)
  (type-break-query-interval (* 10 60))
  (type-break-mode-line-message-mode t))
#+end_src

** Expand-Region

#+begin_src emacs-lisp :tangle modules/my-productivity.el
(use-package expand-region
  :commands er/expand-region
  :bind ("C-=" . er/expand-region))
#+end_src

** Helpful
:PROPERTIES:
:ID:       8fceb308-3d5f-4c30-bd85-105bc0d09ae7
:END:

The =Helpful= package is an alternative to the built-in Emacs and
provides a number of additional features such as more readable
doc-strings, and links to function calls and source-code.

#+begin_src emacs-lisp :tangle modules/my-productivity.el
;; Alternative to built-in Emacs help
(use-package helpful
  :after my-functions
  :bind (("C-h k" . helpful-kill-buffers)
         ("C-h j" . helpful-at-point)
         ("C-h f" . helpful-callable)
         ("C-h F" . helpful-function)
         ("C-h v" . helpful-variable)
         ("C-h k" . helpful-key)
         ("C-h c" . helpful-command)
         ("C-h m" . helpful-macro)
         ("C-h M" . describe-mode))
  :config
  (defun jh/helpful-kill-all-buffers ()
    "Kill all buffers derived from 'help-mode' or 'helpful-mode'."
    (interactive)
    (jh/kill-buffers-by-mode 'help-mode 'helpful-mode)))
#+end_src

** Provide my-productivity.el

#+begin_src emacs-lisp :tangle modules/my-productivity.el
(provide 'my-productivity)

;;; my-productivity.el ends here
#+end_src

* my-writing.el

#+begin_src emacs-lisp :tangle modules/my-writing.el
;;; -*- lexical-binding: t -*-
#+end_src

** Spell Check

Spell checking is important for both things like narratives and git
commits.  The [[https://github.com/minad/jinx][jinx]] package is preferred over the builtin =flyspell= due
to efficiency, keybindings, and ability to save words to a dictionary.

The package uses the API of the =Enchant= library [[[https://abiword.github.io/enchant/][github/enchant]]] and
only analyses visible text (instead of the entire buffer). The =jinx=
package requires the following local packages to provide
spell-checking. Both =enchant= and =pkgconf= are
Arch-specific. Dictionaries are provided by =nuspell= (the modern
version of =hunspell=). See [[https://github.com/minad/jinx][gitub/jinx]] for more details. In Arch,
packages can be download by ~yay enchant pkgconf hunspell~.

  + hunspell :: Spell-checker dictionaries
  + enchant :: Wrapper for spelling libraries
  + pkgconf :: Compiler; used by =jinx= to locate =enchant=

Useful commands include:
  + jinx-next / jinx-previous :: Jump to previous/next visible
    spelling error
  + jinx-correct-all :: Allow user to correct all spelling errors in
    buffer

*QUIRK:* Comments in =src-blocks= are only checked if viewed in an
=org-edit-special= buffer accessed via ~C-c '~ . This is because =jinx= only
checks text possessing specific face properties (see
~jinx-include-faces~ and ~jinx-exclude-faces~). When coding, we are only
interested in checking comments and doc-strings;
~tree-sitter-hl-face:comment~, for example extends this functionality to
=.py= files (see [[*Syntax Highlighting][Syntax Highlighting]]). To check a comment, we would need
to remove =org-block= in ~jinx-exclude-faces~ at the expense of checking
ALL of the code.

#+begin_src elisp :tangle modules/my-writing.el
(use-package jinx
  :hook (org-mode text-mode prog-mode conf-mode)
  :bind (("C-c j c" . jinx-correct)
         ("C-c j a" . jinx-correct-all)
         ;; alias defined using 'jinx-correct' keybinding
         ("C-c j d" . jinx-save-word-at-point))
  :custom
  ;; 'jinx-mode' only checks text possessing specific face properties like
  ;; 'font-lock-comment-face' in 'prog-mode' for example.
  (jinx-include-faces
   '((yaml-mode . conf-mode)
     (yaml-ts-mode . conf-mode)
     ;; Only check docstrings and comments; not strings
     (conf-mode font-lock-comment-face)
     (prog-mode font-lock-comment-face
                font-lock-doc-face
                tree-sitter-hl-face:comment
                tree-sitter-hl-face:doc)))

  (jinx-languages "en_GB")
  :config
  ;; Quickly save word-at-point to dictionary used by 'jinx'
  (defalias 'jinx-save-word-at-point (kmacro "C-c j c @ RET"))

  ;; 'jinx-correct' suggestions displayed as grid instead of long list
  (vertico-multiform-mode 1)
  (add-to-list 'vertico-multiform-categories
               '(jinx grid (vertico-grid-annotate . 20))))
#+end_src

