modules/my-dev.el

;; To provide project management + navigation features
(use-package projectile
  :init (projectile-mode 1)
  :custom
  ;; Cache to prevent slow 'projectile-find-file' on larger projects
  (projectile-enable-caching t)
  :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map)))

;; Update indentation in response to changes to code
(use-package aggressive-indent
  :hook (emacs-lisp-mode))

(use-package yaml-mode
  :mode ("\\.yml\\'" "\\.yaml\\'"))

(provide 'my-dev)

;;; my-dev.el ends here
