README.org
** Denote

The =denote= package is a simple note-taking tool for Emacs that follows
a predictable and descriptive file-naming scheme. See [[denote:20241010T181237][How To Use
Denote]].

#+begin_src emacs-lisp :tangle modules/my-writing.el
(use-package denote
  :commands denote
  :hook (dired-mode . denote-dired-mode)
  :custom
  (denote-directory "~/notes/")
  (denote-file-type "org")
  (denote-prompts '(title keywords))
  (denote-known-keywords '("emacs" "python" "linux" "ml" "work"))
  ;; TODO: use separate templates for coding/ect
  (denote-templates nil)
  (denote-org-front-matter (concat "#+TITLE: %1$s\n"
                                   "#+DATE: %2$s\n"
                                   "#+ID: %4$s\n"
                                   "#+FILETAGS: %3$s\n"
                                   "#+STARTUP: overview\n"))
  :config
  ;; Good idea to update 'org-dblock' links/backlinks before saving buffers
  (add-hook 'before-save-hook (lambda ()
                                (when (denote-file-is-note-p (buffer-file-name))
                                  (org-update-all-dblocks)))))
#+end_src

The =consult-denote= package extends the preview-functionality of
=consult= and provides the following functions:

+ consult-denote-find :: Alternative to ~denote-open-or-create~
+ consult-denote-grep :: Regex to filter files in =denote-directory=

#+begin_src emacs-lisp :tangle modules/my-writing.el
(use-package consult-denote
  :after (consult denote)
  :commands (consult-denote-find))
#+end_src

** Provide my-writing.el

#+begin_src emacs-lisp :tangle modules/my-writing.el
(provide 'my-writing)

;;; my-writing.el ends here
#+end_src

* my-functions.el

#+begin_src emacs-lisp :tangle modules/my-functions.el
;;; -*- lexical-binding: t -*-
#+end_src

** Evaluate init.el

#+begin_src emacs-lisp :tangle modules/my-functions.el
;; Quickly re-evaluate init file
(defun jh/eval-init ()
  (interactive)
  (load-file user-init-file))
#+end_src

** Copy Buffer Name

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/kill-buffer-name ()
  (interactive)
  (kill-new (buffer-name)))
#+end_src

** Copy Relative Buffer Path

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/kill-relative-buffer-path ()
  "Copy relative buffer path to kill ring.

Replace '/home/<username>' prefix with '~' if applicable."
  (interactive)
  (if-let* ((full-path (buffer-file-name))
            (abbrev-path (abbreviate-file-name full-path)))
      (progn
        (kill-new abbrev-path)
        (message "Buffer path copied to kill ring: %s" full-path))
    (message "Buffer is not visiting a file.")))
#+end_src

** Create Org-Mode :file Link to Buffer

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/kill-buffer-orgmode-file-link ()
  "Build [[:file file-path][file-name]] org-link from current
buffer.

The function 'buffer-file-name' returns the absolute path of the
buffer, which breaks should other users open the link. Instead,
the relative path is referenced using the 'abbreviate-file-name'
function."

  (interactive)
  (if-let ((absolute-path (buffer-file-name)))
      (kill-new (message "[[file:%s][%s]]"
                         (abbreviate-file-name absolute-path)
                         (buffer-name)))
    (message "Buffer is not a file")))
#+end_src

** Cleaning Buffer-List

*N.B.* ~M-x crux-kill-other-buffers~ to kill all buffers except current one

*** Kill Buffers Except BUFFER-NAME

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/kill-buffers-except (buffer-name)
  "Kill all buffers except for BUFFER-NAME."
  (dolist (buffer (buffer-list))
    (unless (or (string-equal (buffer-name buffer) buffer-name)
                (string-equal (buffer-name buffer) (concat " " buffer-name)))
      (kill-buffer buffer))))
#+end_src

*** Kill Buffers Except SCRATCH

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/kill-all-buffers-except-scratch ()
  "Kill all buffers except for *scratch*."
  (interactive)
  (jh/kill-buffers-except "*scratch*"))
#+end_src

*** Kill Buffers By Major-Mode

Quickly kill numerous =dired-mode= or =helpful-mode= buffers that
accumulate over time.

*N.B.* Mode-specific functions defined in relevant ~use-package~ calls,
including:

+ [[id:20596bd1-da74-408e-a84e-0b5b9f240398][my-dired.el]]
+ [[id:8fceb308-3d5f-4c30-bd85-105bc0d09ae7][Helpful]]

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/kill-buffers-by-mode (&rest modes)
  "Kill all buffers derived from any of MODES.

Ex: (jh/kill-buffers-by-mode 'help-mode 'helpful-mode)"
  (let ((killed 0))
    (mapc (lambda (buffer)
            (with-current-buffer buffer
              (when (apply #'derived-mode-p modes)
                (kill-buffer buffer)
                (setq killed (1+ killed)))))
          (buffer-list))
    (message "Killed %d buffer(s) derived from %s" killed modes)))
#+end_src

** Jump to Configuration README.org

*N.B.* See related ~M-x crux-find-user-init-file~

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/find-config-file ()
  "Edit '~/.emacs.d/README.org', in other window."
  (interactive)
  (find-file-other-window "~/.emacs.d/README.org"))
#+end_src

** Jump to Minibuffer

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/jump-to-minibuffer ()
  "Switch to minibuffer window (if active)"
  (interactive)
  (when (active-minibuffer-window)
    (select-window (active-minibuffer-window))))
#+end_src

** Parse 'defcustom' of Elisp Files

#+begin_src emacs-lisp :tangle modules/my-functions.el
(defun jh/parse-package-defcustoms ()
  "Parse all `defcustom` variables and their docstrings in the
current buffer, and organize them in an `org-mode` description
list. The variables are sorted alphabetically, and only the first
sentence of each docstring is included."
  (interactive)
  (let ((output-buffer (get-buffer-create "*Parsed defcustom Variables*"))
        ;; Match 'defcustom' followed by the variable name
        (regex "^(defcustom\\s-+\\(\\_<[^[:space:]]+\\_>\\)")
        ;; To store matched defcustom variables and docstrings
        (result '()))
    ;; Search the current buffer for all occurrences of defcustom
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward regex nil t)
        (let ((var-name (match-string 1))
              docstring)
          ;; Move point to skip over the default value
          (forward-sexp)
          ;; Now search for the docstring (next string literal)
          (when (re-search-forward "\"\\([^\"]*\\)\"" nil t)
            (setq docstring (match-string 1)))
          ;; Extract only the first sentence of the docstring
          (when docstring
            (setq docstring (car (split-string docstring "\\.\\s-" t))))
          ;; Collect the variable name and docstring
          (push (list var-name docstring) result))))

    ;; Sort the collected variables alphabetically by name
    (setq result (sort result (lambda (a b) (string< (car a) (car b)))))

    ;; Insert the collected information into the temporary buffer with
    ;; org-mode formatting
    (with-current-buffer output-buffer
      (erase-buffer)
      (org-mode)  ;; Set buffer to org-mode
      (insert "#+TITLE: Parsed defcustom Variables\n\n")
      (dolist (item result)
        (let ((var-name (nth 0 item))
              (docstring (nth 1 item)))
          (insert (format "+ %s :: %s.\n\n" var-name docstring))))
      (goto-char (point-min)))
    (display-buffer output-buffer)
    (mark-whole-buffer)
    (fill-paragraph)))
#+end_src
** Provide my-functions.el

#+begin_src emacs-lisp :tangle modules/my-functions.el
(provide 'my-functions)

;;; my-functions.el ends here
#+end_src

* my-bindings.el

#+begin_src emacs-lisp :tangle modules/my-bindings.el
;;; -*- lexical-binding: t -*-
#+end_src

** Which-Key

The =which-key= minor-mode displays the available keybindings following
an incomplete command [[[https://github.com/justbur/emacs-which-key][github/whichkey]]]. For example, typing ~C-x~ will
open a window showing available keybindings (and descriptions) sharing
the ~C-x~ prefix.

*N.B.* After popup window appears, use ~C-h~ to open additional navigation
options. This is helpful not all keybindings can fit in the popup
window.

#+begin_src emacs-lisp :tangle modules/my-bindings.el
(use-package which-key
  :config (which-key-mode)
  :custom
  (which-key-show-early-on-C-h t     "Trigger which-key manually")
  (which-key-idle-delay 0.5          "Delay before popup appears")
  (which-key-idle-second-delay 0.05  "Responsiveness after triggered")
  (which-key-popup-type 'minibuffer  "Where to show which-key")
  (which-key-max-display-columns nil "N-cols determined from monotor")
  (which-key-separator "  "         "ex: C-x DEL backward-kill-sentence")
  (which-key-add-column-padding 1    "Padding between columns of keys")
  (which-key-show-remaining-keys t   "Show count of keys in modeline"))
#+end_src

** Crux

The "Collection of Ridiculously Useful eXtensions" =crux= package
bundles many useful interactive commands to enhance your overall Emacs
experience. There are many functions [[[https://github.com/bbatsov/crux/blob/master/crux.el][github.com/crux]]] to choose from.

Below, we add a number of useful functions:
  + crux-move-beginning-of-line :: Move point to indentation of line
  + crux-kill-line-backwards :: Kill line backwards and adjust the
    indentation
  + crux-switch-to-previous-buffer :: Switch to previously opened
    buffer
  + crux-view-url :: Open new buffer containing contents of URL

#+begin_src emacs-lisp :tangle modules/my-bindings.el
;; Collection of useful keybindings
(use-package crux
  :bind (([remap move-beginning-of-line] . 'crux-move-beginning-of-line)
         ([remap kill-whole-line] . 'crux-kill-whole-line)
         ("M-o" . 'crux-switch-to-previous-buffer)
         ("C-<backspace>" . 'crux-kill-line-backwards)
         ("C-c 3" . 'crux-view-url)))
#+end_src

** Global Bindings

#+begin_src emacs-lisp :tangle modules/my-bindings.el
;; 'Find-File-At-Point' package adds additional functionality to
;; existing keybindings
(ffap-bindings)

(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "C-c C-;") 'copy-comment-region)
(global-set-key (kbd "C-x O") 'jh/jump-to-minibuffer)

;; Kill current buffer instead of selecting it from minibuffer
(global-set-key (kbd "C-x M-k") 'kill-current-buffer)
#+end_src

