README.org
** General.el

Similar to =use-package=, the =general= package provides a more convenient
method for binding keys in Emacs.

#+BEGIN_src emacs-lisp :tangle modules/my-bindings.el
(use-package general
  :custom
  (general-describe-priority-keymaps nil)
  (general-describe-keymap-sort-function 'general-sort-by-car)
  (general-describe-keybinding-sort-function 'general-sort-by-car)

  :config
  ;; Good to unset before assigning to 'my-leader-def'
  (global-unset-key (kbd "M-m"))

  (general-create-definer my-leader-def
    :keymaps 'global
    :prefix "M-m"))

;; :ignore t to define sub-section headers
(my-leader-def

  ;; BUFFERS
  "b"  '(:ignore t                        :which-key "buffer")
  "bn" '(jh/kill-buffer-name              :which-key "get-buffer-name")
  "bp" '(jh/kill-relative-buffer-path     :which-key "get-relative-path")
  "bl" '(jh/kill-buffer-orgmode-file-link :which-key "get-buffer-orgmode-link")
  "bi" '(crux-find-user-init-file         :which-key "jump-to-init")
  "bc" '(jh/find-config-file              :which-key "jump-to-config")
  "bf" '(ffap-other-window                :which-key "find-file-other-window")

  ;; KILL BUFFERS
  "k"  '(:ignore t                          :which-key "killing")
  "ka" '(jh/kill-all-buffers-except-scratch :which-key "kill-all-buffers")
  "ke" '(crux-kill-other-buffers            :which-key "kill-buffers-except-current"))
#+end_src

** Provide my-bindings.el

#+begin_src emacs-lisp :tangle modules/my-bindings.el
(provide 'my-bindings)

;;; my-bindings.el ends here
#+end_src

* Conclusion
:PROPERTIES:
:ID:       8b5ba82d-d303-4970-ade6-39f82fc08b56
:END:

Finally, we specify the packages (ie top-level org-headers) to be
included in our configuration.

#+begin_src emacs-lisp :tangle init.el
;; Add configuration modules to load path
(add-to-list 'load-path (expand-file-name "modules" user-emacs-directory))

;; Load Pertinent Modules
(require 'my-visuals)
(require 'my-org)
(require 'my-completion)
(require 'my-bindings)
(require 'my-vc)
(require 'my-writing)
(require 'my-productivity)
(require 'my-dev)
(require 'my-functions)
(require 'my-dired)

;;; init.el ends here
#+end_src
